doom/.doom.d/config.org
#+title: Nan0Scho1ar
#+STARTUP: overview
* Config Tangle Setting
:PROPERTIES:
:VISIBILITY: folded
:END:
** Work
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(setq home-config nil
      work-config t)
#+end_src

** Home
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(setq home-config t
      work-config nil)
#+end_src

* Doom File Headers
:PROPERTIES:
:VISIBILITY: folded
:END:
** Init.el
#+begin_src emacs-lisp :tangle no
;;; init.el -*- lexical-binding: t; -*-

;; This file controls what Doom modules are enabled and what order they load
;; in. Remember to run 'doom sync' after modifying it!

;; NOTE Press 'SPC h d h' (or 'C-h d h' for non-vim users) to access Doom's
;;      documentation. There you'll find a "Module Index" link where you'll find
;;      a comprehensive list of Doom's modules and what flags they support.

;; NOTE Move your cursor over a module's name (or its flags) and press 'K' (or
;;      'C-c c k' for non-vim users) to view its documentation. This works on
;;      flags as well (those symbols that start with a plus).
;;
;;      Alternatively, press 'gd' (or 'C-c c d') on a module to browse its
;;      directory (for easy access to its source code).

#+end_src
** Config.el
#+begin_src emacs-lisp :tangle no
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

;; Place your private configuration here! Remember, you do not need to run 'doom
;; sync' after modifying this file!


;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:

;; This determines the style of line numbers in effect. If set to `nil', line
;; numbers are disabled. For relative line numbers, set this to `relative'.


;; Here are some additional functions/macros that could help you configure Doom:
;;
;; - `load!' for loading external *.el files relative to this one
;; - `use-package!' for configuring packages
;; - `after!' for running code after a package has loaded
;; - `add-load-path!' for adding directories to the `load-path', relative to
;;   this file. Emacs searches the `load-path' when you load packages with
;;   `require' or `use-package'.
;; - `map!' for binding new keys
;;
;; To get information about any of these functions/macros, move the cursor over
;; the highlighted symbol at press 'K' (non-evil users must press 'C-c c k').
;; This will open documentation for it, including demos of how they are used.
;;
;; You can also try 'gd' (or 'C-c c d') to jump to their definition and see how
;; they are implemented.

;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.

#+end_src
** Packages.el
#+begin_src emacs-lisp :tangle no
;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el

;; To install a package with Doom you must declare them here and run 'doom sync'
;; on the command line, then restart Emacs for the changes to take effect -- or
;; use 'M-x doom/reload'.


;; To install SOME-PACKAGE from MELPA, ELPA or emacsmirror:
;(package! some-package)

;; To install a package directly from a remote git repo, you must specify a
;; `:recipe'. You'll find documentation on what `:recipe' accepts here:
;; https://github.com/raxod502/straight.el#the-recipe-format
;(package! another-package
;  :recipe (:host github :repo "username/repo"))

;; If the package you are trying to install does not contain a PACKAGENAME.el
;; file, or is located in a subdirectory of the repo, you'll need to specify
;; `:files' in the `:recipe':
;(package! this-package
;  :recipe (:host github :repo "username/repo"
;           :files ("some-file.el" "src/lisp/*.el")))

;; If you'd like to disable a package included with Doom, you can do so here
;; with the `:disable' property:
;(package! builtin-package :disable t)

;; You can override the recipe of a built in package without having to specify
;; all the properties for `:recipe'. These will inherit the rest of its recipe
;; from Doom or MELPA/ELPA/Emacsmirror:
;(package! builtin-package :recipe (:nonrecursive t))
;(package! builtin-package-2 :recipe (:repo "myfork/package"))

;; Specify a `:branch' to install a package from a particular branch or tag.
;; This is required for some packages whose default branch isn't 'master' (which
;; our package manager can't deal with; see raxod502/straight.el#279)
;(package! builtin-package :recipe (:branch "develop"))

;; Use `:pin' to specify a particular commit to install.
;(package! builtin-package :pin "1a2b3c4d5e")


;; Doom's packages are pinned to a specific commit and updated from release to
;; release. The `unpin!' macro allows you to unpin single packages...
;(unpin! pinned-package)
;; ...or multiple packages
;(unpin! pinned-package another-pinned-package)
;; ...Or *all* packages (NOT RECOMMENDED; will likely break things)
;(unpin! t)

;;; Code:

#+end_src
* Init.el
** Home
*** Config toggle
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
(setq home-config t
      work-config nil)
#+end_src
*** Doom Block
**** BEGIN
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
(doom!
#+end_src
**** Completion Framework
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :completion
       company           ; the ultimate code completion backend
       vertico             ; the search engine of the future
#+end_src
**** UI
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :ui
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       doom-quit         ; DOOM quit-message prompts when you quit Emacs
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       indent-guides     ; highlighted indent columns
       ligatures         ; ligatures and symbols to make your code pretty again
       minimap           ; show a map of the code on the side
       modeline          ; snazzy, Atom-inspired modeline, plus API
       nav-flash         ; blink cursor line after big motions
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       tabs              ; a tab bar for Emacs
       treemacs          ; a project drawer, like neotree but cooler
       unicode           ; extended unicode support for various languages
       vc-gutter         ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       window-select     ; visually switch windows
       workspaces        ; tab emulation, persistence & separate workspaces
       zen               ; distraction-free coding or writing
#+end_src
**** Editor
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :editor
       (evil +everywhere); come to the dark side, we have cookies
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       (format +onsave)  ; automated prettiness
       lispy             ; vim for lisp, for people who don't like vim
       snippets          ; my elves. They type so I don't have to
       word-wrap         ; soft wrapping with language-aware indent
#+end_src
**** Emacs
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :emacs
       dired             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       ibuffer         ; interactive buffer management
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree
#+end_src
**** Term
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :term
       eshell            ; the elisp shell that works everywhere
       vterm             ; the best terminal emulation in Emacs
#+end_src
**** Checkers
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :checkers
       syntax              ; tasing you for every semicolon you forget
       (spell +flyspell) ; tasing you for misspelling mispelling
       grammar           ; tasing grammar mistake every you make
#+end_src
**** Tools
 #+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :tools
       editorconfig
       docker
       direnv
       ein               ; tame Jupyter notebooks with emacs
       (eval +overlay)     ; run code, run (also, repls)
       (lookup +dictionary +offline)              ; navigate your code and its documentation
       lsp               ; M-x vscode
       magit             ; a git porcelain for Emacs
       make              ; run make tasks from Emacs
       pass              ; password manager for nerds
       pdf               ; pdf enhancements
       rgb               ; creating color strings
       tree-sitter       ; syntax and parsing, sitting in a tree...
#+end_src
**** OS
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       tty               ; improve the terminal Emacs experience
#+end_src
**** Languages
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :lang
       (beancount +lsp)         ; mind the GAAP
       (cc +lsp +tree-sitter)                ; C > C++ == 1
       (clojure +lsp +tree-sitter)           ; java with a lisp
       (common-lisp +lsp +tree-sitter)       ; if you've seen one lisp, you've seen them all
       (coq)               ; proofs-as-programs
       (csharp +lsp +dotnet +unity +tree-sitter)            ; unity, .NET, and mono shenanigans
       (data +lsp +tree-sitter)              ; config/data formats
       (elixir +lsp +tree-sitter)            ; erlang done right
       (emacs-lisp +lsp +tree-sitter)        ; drown in parentheses
       (erlang +lsp +tree-sitter)            ; an elegant language for a more civilized age
       (ess +lsp +tree-sitter)               ; emacs speaks statistics
       (gdscript +lsp +tree-sitter)          ; the language you waited for
       (go +lsp +tree-sitter)         ; the hipster dialect
       (haskell +dante +tree-sitter)  ; a language that's lazier than I am
       (json +lsp +tree-sitter)              ; At least it ain't XML
       (java +meghanada +lsp +tree-sitter) ; the poster child for carpal tunnel syndrome
       (javascript +lsp +tree-sitter)        ; all(hope(abandon(ye(who(enter(here))))))
       (julia +lsp +tree-sitter)             ; a better, faster MATLAB
       (latex +lsp)             ; writing papers in Emacs has never been so fun
       (lua +lsp +tree-sitter)               ; one-based indices? one-based indices
       (markdown +grip +tree-sitter)          ; writing docs for people to ignore
       (org +dragndrop
            +gnuplot +hugo
            +jupyter +pandoc
            +pomodoro +present
            +pretty +roam2 +tree-sitter)               ; organize your plain life in plain text
       (php +lsp +tree-sitter)               ; perl's insecure younger brother
       (plantuml)          ; diagrams for confusing people more
       (python +lsp +pyright +pyenv +black +tree-sitter)            ; beautiful is better than ugly
       (qt)                ; the 'cutest' gui framework ever
       (racket +lsp +tree-sitter)            ; a DSL for DSLs
       (rest)              ; Emacs as a REST client
       (ruby +rails +tree-sitter)     ; 1.step {|i| p "Ruby is #{i.even? ? 'love' : 'life'}"}
       (rust +lsp +tree-sitter)              ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       (scheme +guile +tree-sitter)   ; a fully conniving family of lisps
       (sh +lsp +tree-sitter)                ; she sells {ba,z,fi}sh shells on the C xor
       (web +lsp +tree-sitter)               ; the tubes
       (yaml +lsp +tree-sitter)              ; JSON, but readable
#+end_src
**** Email
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :email
       (mu4e +gmail)
#+end_src
**** App
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :app
       calendar
       emms
       everywhere        ; *leave* Emacs!? You must be joking
       irc               ; how neckbeards socialize
       (rss +org)        ; emacs as an RSS reader
#+end_src
**** Config
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
       :config
       literate
       (default +bindings +smartparens)
#+end_src
**** END
#+begin_src emacs-lisp :tangle (if home-config "init.el" "no")
)
#+end_src
** Work
*** Config toggle
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
(setq work-config t
      home-config nil)
#+end_src
*** Doom Block
**** BEGIN
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
(doom!
#+end_src
**** Completion Framework
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :completion
       company           ; the ultimate code completion backend
       vertico             ; the search engine of the future
#+end_src
**** UI
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :ui
       doom              ; what makes DOOM look the way it does
       doom-dashboard    ; a nifty splash screen for Emacs
       doom-quit         ; DOOM quit-message prompts when you quit Emacs
       hl-todo           ; highlight TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW
       indent-guides     ; highlighted indent columns
       ligatures         ; ligatures and symbols to make your code pretty again
       minimap           ; show a map of the code on the side
       modeline          ; snazzy, Atom-inspired modeline, plus API
       nav-flash         ; blink cursor line after big motions
       ophints           ; highlight the region an operation acts on
       (popup +defaults)   ; tame sudden yet inevitable temporary windows
       ;; tabs              ; a tab bar for Emacs
       treemacs          ; a project drawer, like neotree but cooler
       unicode           ; extended unicode support for various languages
       vc-gutter         ; vcs diff in the fringe
       vi-tilde-fringe   ; fringe tildes to mark beyond EOB
       window-select     ; visually switch windows
       workspaces        ; tab emulation, persistence & separate workspaces
       zen               ; distraction-free coding or writing
#+end_src
**** Editor
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :editor
       (evil +everywhere); come to the dark side, we have cookies
       file-templates    ; auto-snippets for empty files
       fold              ; (nigh) universal code folding
       (format +onsave)  ; automated prettiness
       lispy             ; vim for lisp, for people who don't like vim
       snippets          ; my elves. They type so I don't have to
       word-wrap         ; soft wrapping with language-aware indent
#+end_src
**** Emacs
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :emacs
       dired             ; making dired pretty [functional]
       electric          ; smarter, keyword-based electric-indent
       ibuffer         ; interactive buffer management
       undo              ; persistent, smarter undo for your inevitable mistakes
       vc                ; version-control and Emacs, sitting in a tree
#+end_src
