doom/.doom.d/config.el
(setq home-config nil
      work-config t)
