doom/.doom.d/config.org
**** Terminal
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :term
       eshell            ; the elisp shell that works everywhere
       vterm             ; the best terminal emulation in Emacs
#+end_src
**** Checkers
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :checkers
       syntax              ; tasing you for every semicolon you forget
       (spell +flyspell) ; tasing you for misspelling mispelling
       grammar           ; tasing grammar mistake every you make
#+end_src
**** Tools
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :tools
       direnv
       editorconfig
       (docker +lsp)
       (eval +overlay)
       (lookup +dictionary +offline)              ; navigate your code and its documentation
       (lsp +peek)               ; M-x vscode
       magit             ; a git porcelain for Emacs
       make              ; run make tasks from Emacs
       pass              ; password manager for nerds
       pdf               ; pdf enhancements
       rgb               ; creating color strings
       tree-sitter       ; syntax and parsing, sitting in a tree...
#+end_src
**** OS
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :os
       (:if IS-MAC macos)  ; improve compatibility with macOS
       tty               ; improve the terminal Emacs experience
#+end_src
**** Languages
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :lang
       (cc +lsp +tree-sitter)                ; C > C++ == 1
       (clojure +lsp +tree-sitter)           ; java with a lisp
       (data)              ; config/data formats
       (elixir +lsp +tree-sitter)            ; erlang done right
       (emacs-lisp +tree-sitter)        ; drown in parentheses
       (go +lsp +tree-sitter)         ; the hipster dialect
       (json +lsp +tree-sitter)              ; At least it ain't XML
       (javascript +lsp +tree-sitter)        ; all(hope(abandon(ye(who(enter(here))))))
       (markdown +grip +tree-sitter)          ; writing docs for people to ignore
       (org +dragndrop +gnuplot
            +hugo +jupyter
            +pandoc +pomodoro
            +present +pretty
            +roam2 +tree-sitter)               ; organize your plain life in plain text
       (php +lsp +tree-sitter)               ; perl's insecure younger brother
       (python +lsp +pyright
               +pyenv +tree-sitter)            ; beautiful is better than ugly
       (racket +lsp +tree-sitter)            ; a DSL for DSLs
       (rest)              ; Emacs as a REST client
       (sh +lsp +tree-sitter)                ; she sells {ba,z,fi}sh shells on the C xor
       (web +lsp +tree-sitter)               ; the tubes
       (yaml +lsp +tree-sitter)              ; JSON, but readable
#+end_src
**** App
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :app
       calendar
       everywhere        ; *leave* Emacs!? You must be joking
#+end_src
**** Config
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
       :config
       literate
       (default +bindings +smartparens)
#+end_src
**** END
#+begin_src emacs-lisp :tangle (if work-config "init.el" "no")
)
#+end_src
* Load private info
#+begin_src emacs-lisp :tangle config.el
(when (file-exists-p! "config-local.el" doom-private-dir)
  (load! "config-local.el" doom-private-dir))
#+end_src
* User Info
#+begin_src emacs-lisp :tangle config.el
(setq user-full-name pii/user-full-name
      user-mail-address pii/user-mail-address)
#+end_src
* Aesthetics
** Theme
#+begin_src emacs-lisp :tangle config.el
(setq doom-theme 'doom-dark-purple)
(setq display-line-numbers-type 'relative)
#+end_src
** Font
#+begin_src emacs-lisp :tangle config.el
(setq doom-font (font-spec :family "JetBrains Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 14)
      doom-big-font (font-spec :family "JetBrains Mono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src
** Smooth Scrolling
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! smooth-scroll)
#+end_src
*** Config
#+begin_src emacs-lisp :tangle config.el
(use-package smooth-scroll
  :init
  (setq smooth-scroll/vscroll-step-size 4
        smooth-scroll-mode t))
#+end_src
** HL TODO KEYWORD FACES
#+begin_src elisp :tangle config.el
(after! hl-todo
  (setq hl-todo-keyword-faces '(("TODO" warning bold)
                                ("FIXME" error bold)
                                ("ERROR" error bold)
                                ("BROKEN" error bold)
                                ("FAIL" error bold)
                                ("FAILING" error bold)
                                ("HACK" font-lock-constant-face bold)
                                ("REMEMBER" font-lock-constant-face bold)
                                ("REVIEW" font-lock-keyword-face bold)
                                ("NOTE" success bold)
                                ("DEPRECATED" font-lock-doc-face bold)
                                ("BUG" error bold)
                                ("XXX" font-lock-constant-face bold))))
#+end_src
** Beacon
#+begin_src emacs-lisp :tangle packages.el
(package! beacon)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(use-package! beacon)
(beacon-mode 1)
#+end_src
** Highlight trailing whitespace
Highlight trailing whitespace and lines greater than 80 chars
#+begin_src emacs-lisp :tangle config.el
(setq whitespace-line-column 80
      whitespace-style '(trailing lines space-before-tab
                                  indentation space-after-tab))
#+end_src
* Editor
** tilt scroll
#+begin_src emacs-lisp :tangle config.el
(setq mouse-wheel-tilt-scroll t)
#+end_src
** n0s1-zen-mode
#+begin_src emacs-lisp :tangle config.el
(setq focus-mode nil)
(setq focus-mode-to-thing '((prog-mode . paragraph) (text-mode . paragraph)))

(defun n0s1-zen-hide ()
  (setq +word-wrap-extra-indent nil)
  ;; (if centaur-tabs-mode (call-interactively #'centaur-tabs-mode) nil)
  (if +word-wrap-mode t (call-interactively #'(+word-wrap-mode)))
  (if git-gutter-mode (call-interactively #'git-gutter-mode) nil)
  (if highlight-indent-guides-mode (call-interactively #'highlight-indent-guides-mode) nil)
  (call-interactively #'menu-bar--display-line-numbers-mode-none)
  ;; (if focus-mode nil (call-interactively #'focus-mode))
  )

(defun n0s1-zen-show ()
  (setq +word-wrap-extra-indent 'double)
  ;; (call-interactively #'centaur-tabs-mode)
  (call-interactively #'git-gutter-mode)
  (if +word-wrap-mode nil (call-interactively #'(+word-wrap-mode)))
  (call-interactively #'highlight-indent-guides-mode)
  (call-interactively #'menu-bar--display-line-numbers-mode-relative)
  ;; (call-interactively #'focus-mode)
  )

(add-hook! 'writeroom-mode-hook
  (if writeroom-mode (n0s1-zen-hide) (n0s1-zen-show)))
#+end_src
** Disable snipe
#+begin_src emacs-lisp :tangle config.el
; Remove s for snipe binding so it reverts to substitute
(after! evil-snipe (evil-snipe-mode -1))
(remove-hook 'doom-first-input-hook #'evil-snipe-mode)
#+end_src
** Restore vim substitute
#+begin_src emacs-lisp :tangle config.el
(map! :n "s" #'evil-substitute)
#+end_src
** Evil surround change
#+begin_src emacs-lisp :tangle config.el
(map! :n "gS" #'evil-surround-change)
#+end_src
** Avy Setup (Easymotion)
#+begin_src emacs-lisp :tangle config.el
(map! :n "S" #'evil-avy-goto-char)
(setq avy-styles-alist '((avy-goto-char . at-full)))
(setq avy-case-fold-search nil)
#+end_src
** Toggle window fullscreen
#+begin_src emacs-lisp :tangle config.el
(setq fullscreen-toggled nil)

(defun my/toggle-fullscreen ()
  (interactive)
  (setq fullscreen-toggled
        (if fullscreen-toggled
            (progn (winner-undo) nil)
          (progn (delete-other-windows) t))))

  (map! :leader :desc "Toggle fullscreen" "w f" #'my/toggle-fullscreen)
#+end_src
** Newline then insert
#+begin_src emacs-lisp config.el :tangle config.el

(defun +evil/insert-newline-above-then-insert (count)
  "insert count blank line(s) above current line then change to insert mode."
  (interactive "p")
  (dotimes (_ count)
    (save-excursion (evil-insert-newline-above)))
  (evil-previous-line count)
  (evil-insert 1))

(defun +evil/insert-newline-below-then-insert (count)
  "insert count blank line(s) below current line then change to insert mode."
  (interactive "p")
  (dotimes (_ count)
    (save-excursion (evil-insert-newline-below)))
  (evil-next-line count)
  (evil-insert 1))

(map! :desc "insert-newline-above-then-insert" :leader "OO" '+evil/insert-newline-above-then-insert)
(map! :desc "insert-newline-below-then-insert" :leader "Oo" '+evil/insert-newline-below-then-insert)
#+end_src
** Message buffer
#+begin_src emacs-lisp :tangle config.el
(defvar my/buffer-before-messages (get-buffer "*Messages*"))

(defun my/toggle-messages ()
  (interactive)
  (if (equal (current-buffer) (get-buffer "*Messages*"))
      (switch-to-buffer my/buffer-before-messages)
    (progn
      (setq my/buffer-before-messages (current-buffer))
      (switch-to-buffer (get-buffer "*Messages*")))))

(map! :leader :desc "Open Messages" "M" #'my/toggle-messages)
#+end_src
** Very large file mode
#+begin_src emacs-lisp :tangle packages.el
(package! vlf)
;; (package! vlf :recipe (:host github :repo "m00natic/vlfi" :files ("*.el"))
;;   :pin "cc02f2533782d6b9b628cec7e2dcf25b2d05a27c" :disable t)
#+end_src

To make VLF available without delaying startup, we'll just load it in quiet moments.
#+begin_src emacs-lisp :tangle config.el
(use-package! vlf-setup)
;; (use-package! vlf-setup
;;   :defer-incrementally vlf-tune vlf-base vlf-write vlf-search vlf-occur vlf-follow vlf-ediff vlf)
#+end_src
* Langs
** General Code
*** Box comments (rebox2)
#+begin_src emacs-lisp :tangle packages.el
(package! rebox2)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(use-package! rebox2)
#+end_src
