doom/.doom.d/config.el

(when (file-exists-p! "config-local.el" doom-private-dir)
  (load! "config-local.el" doom-private-dir))

(setq user-full-name pii/user-full-name
      user-mail-address pii/user-mail-address)

(setq doom-theme 'doom-dark-purple)
(setq display-line-numbers-type 'relative)

(setq doom-font (font-spec :family "JetBrains Mono" :size 14)
      doom-variable-pitch-font (font-spec :family "JetBrains Mono" :size 14)
      doom-big-font (font-spec :family "JetBrains Mono" :size 24))
(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))
(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

(use-package smooth-scroll
  :init
  (setq smooth-scroll/vscroll-step-size 4
        smooth-scroll-mode t))

(after! hl-todo
  (setq hl-todo-keyword-faces '(("TODO" warning bold)
                                ("FIXME" error bold)
                                ("ERROR" error bold)
                                ("BROKEN" error bold)
                                ("FAIL" error bold)
                                ("FAILING" error bold)
                                ("HACK" font-lock-constant-face bold)
                                ("REMEMBER" font-lock-constant-face bold)
                                ("REVIEW" font-lock-keyword-face bold)
                                ("NOTE" success bold)
                                ("DEPRECATED" font-lock-doc-face bold)
                                ("BUG" error bold)
                                ("XXX" font-lock-constant-face bold))))

(use-package! beacon)
(beacon-mode 1)

(setq whitespace-line-column 80
      whitespace-style '(trailing lines space-before-tab
                                  indentation space-after-tab))

(setq mouse-wheel-tilt-scroll t)

(setq focus-mode nil)
(setq focus-mode-to-thing '((prog-mode . paragraph) (text-mode . paragraph)))

(defun n0s1-zen-hide ()
  (setq +word-wrap-extra-indent nil)
  ;; (if centaur-tabs-mode (call-interactively #'centaur-tabs-mode) nil)
  (if +word-wrap-mode t (call-interactively #'(+word-wrap-mode)))
  (if git-gutter-mode (call-interactively #'git-gutter-mode) nil)
  (if highlight-indent-guides-mode (call-interactively #'highlight-indent-guides-mode) nil)
  (call-interactively #'menu-bar--display-line-numbers-mode-none)
  ;; (if focus-mode nil (call-interactively #'focus-mode))
  )

(defun n0s1-zen-show ()
  (setq +word-wrap-extra-indent 'double)
  ;; (call-interactively #'centaur-tabs-mode)
  (call-interactively #'git-gutter-mode)
  (if +word-wrap-mode nil (call-interactively #'(+word-wrap-mode)))
  (call-interactively #'highlight-indent-guides-mode)
  (call-interactively #'menu-bar--display-line-numbers-mode-relative)
  ;; (call-interactively #'focus-mode)
  )

(add-hook! 'writeroom-mode-hook
  (if writeroom-mode (n0s1-zen-hide) (n0s1-zen-show)))

; Remove s for snipe binding so it reverts to substitute
(after! evil-snipe (evil-snipe-mode -1))
(remove-hook 'doom-first-input-hook #'evil-snipe-mode)

(map! :n "s" #'evil-substitute)

(map! :n "gS" #'evil-surround-change)

(map! :n "S" #'evil-avy-goto-char)
(setq avy-styles-alist '((avy-goto-char . at-full)))
(setq avy-case-fold-search nil)

(setq fullscreen-toggled nil)

(defun my/toggle-fullscreen ()
  (interactive)
  (setq fullscreen-toggled
        (if fullscreen-toggled
            (progn (winner-undo) nil)
          (progn (delete-other-windows) t))))

  (map! :leader :desc "Toggle fullscreen" "w f" #'my/toggle-fullscreen)

(defun +evil/insert-newline-above-then-insert (count)
  "insert count blank line(s) above current line then change to insert mode."
  (interactive "p")
  (dotimes (_ count)
    (save-excursion (evil-insert-newline-above)))
  (evil-previous-line count)
  (evil-insert 1))

(defun +evil/insert-newline-below-then-insert (count)
  "insert count blank line(s) below current line then change to insert mode."
  (interactive "p")
  (dotimes (_ count)
    (save-excursion (evil-insert-newline-below)))
  (evil-next-line count)
  (evil-insert 1))

(map! :desc "insert-newline-above-then-insert" :leader "OO" '+evil/insert-newline-above-then-insert)
(map! :desc "insert-newline-below-then-insert" :leader "Oo" '+evil/insert-newline-below-then-insert)

(defvar my/buffer-before-messages (get-buffer "*Messages*"))

(defun my/toggle-messages ()
  (interactive)
  (if (equal (current-buffer) (get-buffer "*Messages*"))
      (switch-to-buffer my/buffer-before-messages)
    (progn
      (setq my/buffer-before-messages (current-buffer))
      (switch-to-buffer (get-buffer "*Messages*")))))

(map! :leader :desc "Open Messages" "M" #'my/toggle-messages)

(use-package! vlf-setup)
;; (use-package! vlf-setup
;;   :defer-incrementally vlf-tune vlf-base vlf-write vlf-search vlf-occur vlf-follow vlf-ediff vlf)

(use-package! rebox2)
