doom/.doom.d/packages.el
(package! smooth-scroll)

(package! beacon)

(package! vlf)
;; (package! vlf :recipe (:host github :repo "m00natic/vlfi" :files ("*.el"))
;;   :pin "cc02f2533782d6b9b628cec7e2dcf25b2d05a27c" :disable t)

(package! rebox2)
