doom/.doom.d/config.org
*** Make executable
#+begin_src emacs-lisp :tangle config.el
(defun toggle-buffer-exec ()
"Mark the file for the current buffer executable."
  (interactive)
    (let ((fname (buffer-file-name)))
        (when fname
          (if (= (file-modes fname) 493)
             (progn
                (set-file-modes fname #o644)
                (message "Set \"%s\" as not executable (%s)" fname "#o644"))
             (progn
                (set-file-modes fname #o755)
                (message "Set \"%s\" as executable (%s)" fname "#o755"))))))

(map! :leader :desc "Toggle file as executable" :g "fx" #'toggle-buffer-exec)
#+end_src
*** Enable tree-sitter globally
#+begin_src emacs-lisp :tangle config.el
(after! tree-sitter
  (setq global-tree-sitter-mode 1))
#+end_src
*** Snippets
**** yasnippet default snippets
#+begin_src emacs-lisp :tangle packages.el
(package! yasnippet-snippets)
#+end_src
** Org
*** Find-org-files-in-dirs
#+begin_src emacs-lisp :tangle config.el
(defun find-org-files-in-dir (dir &optional base-dir)
  "Find all org files in each of the child dirs in BASE-DIR."
    (directory-files-recursively (expand-file-name dir base-dir) "\.org$"))

(defun find-org-files-in-dirs (base-dir children)
  "Find all org files in each of the child dirs in BASE-DIR."
  (mapcan (lambda (x) (find-org-files-in-dir x base-dir)) children))
#+end_src
*** Base Org
**** Home
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(after! org
  (setq org-directory pii/org-directory
        +org-capture-todo-file "todos/todo.org"
        +org-capture-notes-file "personal/me/notes.org"
        +org-capture-journal-file "personal/me/journal.org"
        +org-capture-changelog-file "changelog.org"
        n0s1-agenda-dirs '("personal" "projects" "todos" "work")
        org-agenda-files (find-org-files-in-dirs org-directory n0s1-agenda-dirs)))
#+end_src
**** Work
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(after! org
  (setq org-directory pii/org-directory
        org-agenda-files (find-org-files-in-dir org-directory)))
#+end_src
**** Both
#+begin_src emacs-lisp :tangle config.el
(after! org
  (setq org-default-notes-file +org-capture-notes-file
        org-capture-journal-file +org-capture-journal-file
        org-capture-todo-file +org-capture-todo-file
        org-agenda-restore-windows-after-quit t
        org-habit-show-habits-only-for-today nil
        org-ellipsis " ▼ "
        org-log-done 'time
        org-journal-date-format "%B %d, %Y (%A) "
        org-journal-file-format "%Y-%m-%d.org"
        org-modules '(org-habit ol-bibtex)
        org-hide-emphasis-markers t
        org-id-link-to-org-use-id t
        ;; ex. of org-link-abbrev-alist in action
        ;; [[arch-wiki:Name_of_Page][Description]]
        ; This overwrites the default Doom org-link-abbrev-list
        ;; org-link-abbrev-alist '(("google" . "http://www.google.com/search?q=")
        ;;                         ("arch-wiki" . "https://wiki.archlinux.org/index.php/")
        ;;                         ("ddg" . "https://duckduckgo.com/?q=")
        ;;                         ("wiki" . "https://en.wikipedia.org/wiki/"))
        ; This overwrites the default Doom org-todo-keywords
        org-todo-keywords '((sequence
                             "TODO(t)"
                             "NEXT(n)"
                             "IN PROGRESS(i)"
                             "SOMEDAY(s)"
                             "TO DEFINE(T)"
                             "MAYBE(m)"
                             "REMEMBER(r)"
                             "WAITING(w)"
                             "|"
                             "DONE(d)"
                             "CANCELLED(c)" ))))
(custom-set-faces
 '(org-level-1 ((t (:inherit outline-1 :height 1.6))))
 '(org-level-2 ((t (:inherit outline-2 :height 1.4))))
 '(org-level-3 ((t (:inherit outline-3 :height 1.3))))
 '(org-level-4 ((t (:inherit outline-4 :height 1.2))))
 '(org-level-5 ((t (:inherit outline-5 :height 1.1)))))

  ;;(add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src
*** Library of babel
**** SQL Library of babel helpers
#+begin_src emacs-lisp :tangle "config.el"
(after! org
    (org-babel-lob-ingest pii/org-babel-lob-ingest))
#+end_src
*** Org tempo
#+begin_src emacs-lisp :tangle config.el
(use-package! org-tempo
  :after org
  :init
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("sql" . "src SQL"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp")))
#+end_src
*** Org capture templates
**** Template builder functions
#+begin_src emacs-lisp :tangle config.el
(defun build-org-capture-template-headline (state tags scheduled)
  (let ((ts "\nSCHEDULED: %(org-insert-time-stamp (org-read-date nil t) nil nil nil nil)"))
    (concat "\n** " state " %? " tags (when scheduled ts) "\n\n%a\n")))

(defun build-org-capture-template (hotkey whichkey-prompt heading state tags scheduled &optional file)
  "Create an org capture template file defaults to todofile"
  (unless file (setq file +org-capture-todo-file))
  `(,hotkey ,whichkey-prompt entry
         (file+headline ,file ,heading)
         ,(build-org-capture-template-headline state tags scheduled) :prepend t))

(defun build-org-capture-templates (param-list)
  (mapcar (lambda (x) (apply #'build-org-capture-template x)) param-list))

(defun build-org-todo-capture-template (key name)
  (let ((tags (if name (format ":%s:" (upcase name)) ""))
        (heading (if name name "Inbox"))
        (prompt (if name (concat name " ") "")))
    (list
     (build-org-capture-template
      (downcase key) (format "TODO %sScheduled" prompt) heading "TODO" tags t)
     (build-org-capture-template
      (upcase key) (format "TODO %sUnscheduled" prompt) heading "TODO" tags t))))

(defun build-org-todo-capture-templates (pairs)
  (mapcan (lambda (y) (build-org-todo-capture-template (car y) (cadr y))) pairs))

#+end_src
**** Both
#+begin_src emacs-lisp :tangle config.el
(setq org-project-capture-templates
      ;; Will use {project-root}/{todo,notes,changelog}.org, unless a
      ;; {todo,notes,changelog}.org file is found in a parent directory.
      ;; Uses the basename from `+org-capture-todo-file',
      ;; `+org-capture-changelog-file' and `+org-capture-notes-file'.
      '(("p" "Templates for projects")
        ("pt" "Project-local todo" entry  ; {project-root}/todo.org
         (file+headline +org-capture-project-todo-file "Inbox")
         "* TODO %?\n%i\n%a" :prepend t)
        ("pn" "Project-local notes" entry  ; {project-root}/notes.org
         (file+headline +org-capture-project-notes-file "Inbox")
         "* %U %?\n%i\n%a" :prepend t)
        ("pc" "Project-local changelog" entry  ; {project-root}/changelog.org
         (file+headline +org-capture-project-changelog-file "Unreleased")
         "* %U %?\n%i\n%a" :prepend t)
        ;; Will use {org-directory}/{+org-capture-projects-file} and store
        ;; these under {ProjectName}/{Tasks,Notes,Changelog} headings. They
        ;; support `:parents' to specify what headings to put them under, e.g.
        ;; :parents ("Projects")
        ("o" "Centralized templates for projects")
        ("ot" "Project todo" entry
         (function +org-capture-central-project-todo-file)
         "* TODO %?\n %i\n %a"
         :heading "Tasks"
         :prepend nil)
        ("on" "Project notes" entry
         (function +org-capture-central-project-notes-file)
         "* %U %?\n %i\n %a"
         :heading "Notes"
         :prepend t)
        ("oc" "Project changelog" entry
         (function +org-capture-central-project-changelog-file)
         "* %U %?\n %i\n %a"
         :heading "Changelog"
         :prepend t)))

(setq org-someday-capture-templates
      (build-org-capture-templates
       '(("s" "SOMEDAY LIFE"     "Eventually" "SOMEDAY" ":LIFE:" nil)
         ("S" "SOMEDAY Untagged" "Eventually" "SOMEDAY" ""       nil))))

#+end_src
**** Home
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(setq org-personal-capture-templates
      '(("n" "Personal notes" entry
         (file+headline +org-capture-notes-file "Notes")
         "* %u %?\n%i\n%a" :prepend t)

        ("j" "Journal" entry
         (file+olp+datetree +org-capture-journal-file)
         "* %U %?\n%i\n%a" :prepend t)))

(setq org-paired-capture-templates
      (build-org-todo-capture-templates '(("t" nil)
                                          ("l" "Life")
                                          ("w" "Work")
                                          ("e" "Email")))
      )

(after! org
  (setq org-capture-templates
        (append org-paired-capture-templates
                org-someday-capture-templates
                org-personal-capture-templates
                org-project-capture-templates)))
#+end_src
**** Work
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(after! org
  (setq org-capture-templates
        (append (build-org-todo-capture-templates '(("t" nil)))
                org-someday-capture-templates
                org-project-capture-templates)))
#+end_src

