doom/.doom.d/packages.el

(package! yasnippet-snippets)
