doom/.doom.d/config.org
*** Org tangle binding
#+begin_src emacs-lisp :tangle config.el
(map! :leader :desc "Org babel tangle" "m B" #'org-babel-tangle)
#+end_src
*** Org-Alert
#+begin_src emacs-lisp :tangle packages.el
(package! org-alert)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(use-package! org-alert :config
    (setq alert-default-style 'libnotify))
#+end_src
*** Org super agenda
#+begin_src emacs-lisp :tangle packages.el
(package! org-super-agenda)
#+end_src
**** Super Agenda Layouts
Regular agenda does not include habits
Day agenda does include habits
***** Both
#+begin_src emacs-lisp :tangle config.el
(use-package! org-super-agenda)
#+end_src
***** Home
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(setq n0s1-org-super-agenda-week-config
       '((:log t)  ; Automatically named "Log"
         (:discard (:tag ("habit" "optional" "self_care")))
         (:name "Schedule" :time-grid t :order 0)
         (:name "Today" :scheduled today :order 1)
         (:name "Due today" :deadline today :order 2)
         (:name "Overdue" :deadline past :order 3)
         (:name "Due soon" :deadline future :order 5)
         (:name "Scheduled earlier" :scheduled past :order 4)
         (:name "Unimportant" :auto-tags
          (:todo ("SOMEDAY" "MAYBE" "TO-READ")) :order 100)
         (:name "Waiting..." :todo "WAITING" :order 98)))

(setq n0s1-org-super-agenda-day-config
      '((:log t)  ; Automatically named "Log"
        (:name "Due soon" :deadline future :order 7)
        (:name "Habits" :tag "habit" :order 5)
        (:name "Self Care" :tag "self_care" :order 6)
        (:name "Optional" :tag "optional" :order 8)
        (:name "Schedule" :time-grid t :order 0)
        (:name "Today" :scheduled today :order 3)
        (:name "Due today" :deadline today :order 4)
        (:name "Overdue" :deadline past :order 2)
        (:name "Scheduled earlier" :scheduled past :order 1)
        (:name "Remember" :todo "REMEMBER" :order 90)
        (:name "Unimportant" :auto-tags
         (:todo ("SOMEDAY" "MAYBE" "TO-READ")) :order 100)
        (:name "Waiting..." :todo "WAITING" :order 98)))
#+end_src
***** Work
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(setq n0s1-org-super-agenda-week-config
       '((:log t)  ; Automatically named "Log"
         (:discard (:tag ("habit" "optional")))
         (:name "Schedule" :time-grid t :order 0)
         (:name "Today" :scheduled today :order 1)
         (:name "Due today" :deadline today :order 2)
         (:name "Overdue" :deadline past :order 3)
         (:name "Due soon" :deadline future :order 5)
         (:name "Scheduled earlier" :scheduled past :order 4)
         (:name "Unimportant" :auto-tags
          (:todo ("SOMEDAY" "MAYBE" "TO-READ")) :order 100)
         (:name "Waiting..." :todo "WAITING" :order 98)))

(setq n0s1-org-super-agenda-day-config
      '((:log t)  ; Automatically named "Log"
        (:name "Due soon" :deadline future :order 7)
        (:name "Habits" :tag "habit" :order 5)
        (:name "Optional" :tag "optional" :order 8)
        (:name "Schedule" :time-grid t :order 0)
        (:name "Today" :scheduled today :order 3)
        (:name "Due today" :deadline today :order 4)
        (:name "Overdue" :deadline past :order 2)
        (:name "Scheduled earlier" :scheduled past :order 1)
        (:name "Remember" :todo "REMEMBER" :order 90)
        (:name "Unimportant" :auto-tags
         (:todo ("SOMEDAY" "MAYBE" "TO-READ")) :order 100)
        (:name "Waiting..." :todo "WAITING" :order 98)))
#+end_src
**** Super Agenda Views
***** Home
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(setq org-super-agenda-groups n0s1-org-super-agenda-week-config)

(setq org-agenda-custom-commands
      '(("n" "n0s1 day view"
         ((agenda "" ((org-agenda-span 'day)
                      (org-agenda-start-day nil)
                      (org-super-agenda-groups
                       n0s1-org-super-agenda-day-config)))))
        ("T"  "all todos view"
         ((alltodo "" ((org-super-agenda-groups '((:auto-category t)))))))
        ("tl" "todo life view"       ((tags-todo "LIFE")))
        ("tn" "todo n0s1 view"       ((tags-todo "n0s1")))
        ("tc" "todo n0s1.core view"  ((tags-todo "n0s1_core")))
        ("tb" "todo ByteSource view" ((tags-todo "BYTESOURCE")))))
#+end_src
***** Work
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(setq org-super-agenda-groups n0s1-org-super-agenda-week-config)

(setq org-agenda-custom-commands
      '(("n" "n0s1 day view"
         ((agenda "" ((org-agenda-span 'day)
                      (org-agenda-start-day nil)
                      (org-super-agenda-groups
                       n0s1-org-super-agenda-day-config)))))
        ("T"  "all todos view"
         ((alltodo "" ((org-super-agenda-groups '((:auto-category t)))))))
        ("tD" "todo DB view"  ((tags-todo "DB")))
        ("tM" "todo MW view"  ((tags-todo "MW")))
        ("tR" "todo RMS view" ((tags-todo "RMS")))
        ("tS" "todo SAM view" ((tags-todo "SAM")))))
#+end_src
**** Bindings
***** Both
#+begin_src emacs-lisp :tangle config.el
(defun n0s1-agenda-day-view (&optional arg)
  (interactive "P")
  (org-agenda arg "n"))

(defun n0s1-agenda-all-todos-view (&optional arg)
  (interactive "P")
  (org-agenda arg "T"))

(map! :desc "Org Agenda Day View" :leader "A" 'n0s1-agenda-day-view)
(map! :desc "Org Agenda Day View" :leader "T" 'n0s1-agenda-all-todos-view)
#+end_src
**** Hook
***** Both
#+begin_src emacs-lisp :tangle config.el
(add-hook 'after-init-hook 'org-super-agenda-mode)
#+end_src
*** Org Roam
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(use-package! org-roam
  :custom
  (org-roam-v2-ack t)
  (org-roam-directory pii/personal-org-roam-directory)
  (personal-org-roam-directory pii/personal-org-roam-directory)
  (org-roam-capture-templates
   '(("d" "default            (general:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/default.org")))
      :if-new (file+head      "public/general/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("A" "Author             (literature:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/author.org")))
      :if-new (file+head      "public/literature/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Author:")
      :unnarrowed t)
     ("B" "Book               (literature:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/book.org")))
      :if-new (file+head      "public/literature/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Book:")
      :unnarrowed t)
     ("b" "book note          (literature:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/book_note.org")))
      :if-new (file+head      "public/literature/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :BookNote:")
      :unnarrowed t)
     ("F" "food [recipe]      (food:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/food_recipe.org")))
      :if-new (file+head      "public/food/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Food:Recipe:")
      :unnarrowed t)
     ("f" "food [ingredient]  (food:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/food_ingredient.org")))
      :if-new (file+head      "public/food/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Food:Ingredient:")
      :unnarrowed t)
     ("L" "Language           (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/language.org")))
      :if-new (file+head      "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Language:")
      :unnarrowed t)
     ("l" "language note      (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/language_note.org")))
      :if-new (file+head      "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :LanguageNote:")
      :unnarrowed t)
     ("S" "Software           (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/software.org")))
      :if-new (file+head      "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Software:")
      :unnarrowed t)
     ("s" "software note      (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/software_note.org")))
      :if-new (file+head      "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :SoftwareNote:")
      :unnarrowed t)
     ;; Private
     ("R" "Repository         (repos:private)" plain (file (file-truename (concat personal-org-roam-directory "/templates/repository.org")))
      :if-new (file+head      "private/repos/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Repository:Project:n0s1:")
      :unnarrowed t)
     ("r" "repository note    (repos:private)" plain (file (file-truename (concat personal-org-roam-directory "/templates/repository_note.org")))
      :if-new (file+head      "private/repos/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :RepositoryNote:Project:n0s1:")
      :unnarrowed t)
     ("P" "Project            (proj:private)" plain (file (file-truename (concat personal-org-roam-directory "/templates/project.org")))
      :if-new (file+head      "private/proj/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Project:n0s1:")
      :unnarrowed t)
     ("p" "project note       (proj:private)" plain (file (file-truename (concat personal-org-roam-directory "/templates/project_note.org")))
      :if-new (file+head      "private/proj/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :ProjectNote:n0s1:")
      :unnarrowed t)
     ;; TODO Fix these templates
     ("W" "Work [general] (work/general:private)" plain (file (file-truename (concat org-roam-directory "/templates/software.org")))
      :if-new (file+head  "private/work/general/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Work:")
      :unnarrowed t)
     ("w" (concat "Work [" pii/employer "]  (work/" pii/employer ":private)") plain (file (file-truename (concat org-roam-directory "/templates/software_note.org")))
      :if-new (file+head (concat "private/work/" pii/employer "/<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Work:" pii/employer ":"))
      :unnarrowed t)
     ))
  (org-roam-dailies-directory "daily/")
  (org-roam-dailies-capture-templates
   '(("d" "default" entry (file (file-truename (concat personal-org-roam-directory "/templates/default_daily.org")))
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n[[id:71cca294-dc20-4648-a5d2-bcfde321ff19][Day]]"))
     ("D" "Dream" entry (file (file-truename (concat personal-org-roam-directory "/templates/dream.org")))
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n[[id:71cca294-dc20-4648-a5d2-bcfde321ff19][Day]]"))
     ("t" "thought" entry (file (file-truename (concat personal-org-roam-directory "/templates/thought.org")))
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n[[id:71cca294-dc20-4648-a5d2-bcfde321ff19][Day]]"))
     ("i" "idea" entry (file (file-truename (concat personal-org-roam-directory "/templates/idea.org")))
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n[[id:71cca294-dc20-4648-a5d2-bcfde321ff19][Day]]"))
     ("j" "joke" entry (file (file-truename (concat personal-org-roam-directory "/templates/joke.org")))
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n[[id:71cca294-dc20-4648-a5d2-bcfde321ff19][Day]]"))))
  :config (org-roam-setup))

#+end_src

