doom/.doom.d/config.el

(map! :leader :desc "Org babel tangle" "m B" #'org-babel-tangle)

(use-package! org-alert :config
    (setq alert-default-style 'libnotify))

(use-package! org-roam
  :custom
  (org-roam-v2-ack t)
  (org-roam-directory pii/org-roam-directory)
  (personal-org-roam-directory pii/personal-org-roam-directory)
  (org-roam-capture-templates
   '(("d" "default        (general:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/default.org")))
      :if-new (file+head  "public/general/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("L" "Language       (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/language.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Language:")
      :unnarrowed t)
     ("l" "language note  (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/language_note.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :LanguageNote:")
      :unnarrowed t)
     ("S" "Software       (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/software.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Software:")
      :unnarrowed t)
     ("s" "software note  (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/software_note.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :SoftwareNote:")
      :unnarrowed t)
     ;; Private
     ;; TODO Fix these templates
     ("W" "Work [general] (work/general:private)" plain (file (file-truename (concat org-roam-directory "/templates/software.org")))
      :if-new (file+head  "private/work/general/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Work:")
      :unnarrowed t)
     ("w" (concat "Work [" pii/employer "]  (work/" pii/employer ":private)" plain (file (file-truename (concat org-roam-directory "/templates/software_note.org")))
      :if-new (file+head  (concat "private/work/" pii/employer "/<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Work:" pii/employer ":"))
      :unnarrowed t)
     )))
  (org-roam-dailies-directory "daily/")
  (org-roam-dailies-capture-templates
   '(("d" "default" entry (file (file-truename (concat personal-org-roam-directory "/templates/default_daily.org")))
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n[[id:71cca294-dc20-4648-a5d2-bcfde321ff19][Day]]"))))
  :config (org-roam-setup))

(after! org-roam
