doom/.doom.d/packages.el

(package! org-alert)

(package! org-super-agenda)
