doom/.doom.d/config.org
**** Work
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(use-package! org-roam
  :custom
  (org-roam-v2-ack t)
  (org-roam-directory pii/org-roam-directory)
  (personal-org-roam-directory pii/personal-org-roam-directory)
  (org-roam-capture-templates
   '(("d" "default        (general:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/default.org")))
      :if-new (file+head  "public/general/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
      :unnarrowed t)
     ("L" "Language       (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/language.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Language:")
      :unnarrowed t)
     ("l" "language note  (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/language_note.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :LanguageNote:")
      :unnarrowed t)
     ("S" "Software       (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/software.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Software:")
      :unnarrowed t)
     ("s" "software note  (technology:public)" plain (file (file-truename (concat personal-org-roam-directory "/templates/software_note.org")))
      :if-new (file+head  "public/technology/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :SoftwareNote:")
      :unnarrowed t)
     ;; Private
     ;; TODO Fix these templates
     ("W" "Work [general] (work/general:private)" plain (file (file-truename (concat org-roam-directory "/templates/software.org")))
      :if-new (file+head  "private/work/general/%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Work:")
      :unnarrowed t)
     ("w" (concat "Work [" pii/employer "]  (work/" pii/employer ":private)") plain (file (file-truename (concat org-roam-directory "/templates/software_note.org")))
      :if-new (file+head  (concat "private/work/" pii/employer "/<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n#+filetags: :Work:" pii/employer ":"))
      :unnarrowed t)
     ))
  (org-roam-dailies-directory "daily/")
  (org-roam-dailies-capture-templates
   '(("d" "default" entry (file (file-truename (concat personal-org-roam-directory "/templates/default_daily.org")))
      :if-new (file+head "%<%Y-%m-%d>.org" "#+title: %<%Y-%m-%d>\n[[id:71cca294-dc20-4648-a5d2-bcfde321ff19][Day]]"))))
  :config (org-roam-setup))

#+end_src

**** Both
#+begin_src emacs-lisp :tangle config.el
(after! org-roam
  (map! (:prefix ("C-c n" . "roam")
         :desc "org-roam-node-random"              "a" #'org-roam-node-random
         :desc "org-roam-node-find"                "f" #'org-roam-node-find
         :desc "org-roam-ref-find"                 "F" #'org-roam-ref-find
         :desc "org-roam-graph"                    "g" #'org-roam-graph
         :desc "org-roam-node-insert"              "i" #'org-roam-node-insert
         :desc "org-roam-capture"                  "c" #'org-roam-capture
         :desc "org-roam-buffer-toggle"            "r" #'org-roam-buffer-toggle
         :desc "org-roam-buffer-display-dedicated" "R" #'org-roam-buffer-display-dedicated
         :desc "org-roam-db-sync"                  "s" #'org-roam-db-sync))

  (map! (:prefix ("C-c n d" . "dailies")
         :desc "org-roam-dailies-find-directory"     "-" #'org-roam-dailies-find-directory
         :desc "org-roam-dailies-goto-previous-note" "b" #'org-roam-dailies-goto-previous-note
         :desc "org-roam-dailies-goto-next-note"     "f" #'org-roam-dailies-goto-next-note
         :desc "org-roam-dailies-capture-today"      "n" #'org-roam-dailies-capture-today
         :desc "org-roam-dailies-capture-date"       "d" #'org-roam-dailies-capture-date
         :desc "org-roam-dailies-goto-date"          "D" #'org-roam-dailies-goto-date
         :desc "org-roam-dailies-capture-tomorrow"   "m" #'org-roam-dailies-capture-tomorrow
         :desc "org-roam-dailies-goto-tomorrow"      "M" #'org-roam-dailies-goto-tomorrow
         :desc "org-roam-dailies-capture-today"      "t" #'org-roam-dailies-capture-today
         :desc "org-roam-dailies-goto-today"         "T" #'org-roam-dailies-goto-today
         :desc "org-roam-dailies-capture-yesterday"  "y" #'org-roam-dailies-capture-yesterday
         :desc "org-roam-dailies-goto-yesterday"     "Y" #'org-roam-dailies-goto-yesterday))

  (map! (:prefix ("C-c n o" . "organize")
         :desc "org-roam-demote-entire-buffer" "d" #'org-roam-demote-entire-buffer
         :desc "org-roam-link-replace-all"     "s" #'org-roam-link-replace-all
         :desc "org-id-get-create"             "i" #'org-id-get-create
         :desc "org-roam-refile"               "f" #'org-roam-refile
         :desc "org-roam-alias-add"            "a" #'org-roam-alias-add
         :desc "org-roam-alias-remove"         "A" #'org-roam-alias-remove
         :desc "org-roam-ref-add"              "r" #'org-roam-ref-add
         :desc "org-roam-ref-remove"           "R" #'org-roam-ref-remove
         :desc "org-roam-tag-add"              "t" #'org-roam-tag-add
         :desc "org-roam-tag-remove"           "T" #'org-roam-tag-remove)))
#+end_src
***** Websocket
#+begin_src emacs-lisp :tangle config.el
(use-package! websocket :after org-roam)
#+end_src
*** Org Roam UI
#+begin_src emacs-lisp :tangle packages.el
(package! org-roam-ui)
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package! org-roam-ui :after org-roam :hook (org-roam . org-roam-ui-mode) :config)
#+end_src
*** Org-modern
**** Package
#+begin_src emacs-lisp :tangle packages.el
(package! org-modern)
#+end_src
**** Config
#+begin_src emacs-lisp :tangle config.el
(use-package! org-modern)
(after! org-modern
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq
   ;; Edit settings
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   org-ellipsis "…"

   ;; Agenda styling
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  (global-org-modern-mode))
#+end_src
*** Org Babel SQL
#+begin_src emacs-lisp :tangle config.el
(defun string-to-tablified-buffer (str buffer-name sep)
  (with-current-buffer (get-buffer-create buffer-name)
    (org-mode)
    (org-modern-mode -1)
    (+word-wrap-mode -1)
    (erase-buffer)
    (insert str)
    (org-table-convert-region (point-min) (point-max) sep)
    (goto-line 2)
    (insert "|-|\n")
    (goto-char (point-min))
    (insert "|-|\n")
    (goto-char (point-max))
    (insert "|-|\n")
    (org-table-align)
    (beginning-of-buffer)
    (current-buffer)))

(defun tablify-sql-results (results)
  (string-to-tablified-buffer results "*SQL Results*" "\t"))

(defun my/popup-sql-results ()
  (interactive)
  (+popup-buffer (get-buffer-create "*SQL Results*")))

#+end_src
*** Org heading IDs
#+begin_src emacs-lisp :tangle config.el
(defun my/org-add-ids-to-headlines-in-file ()
  "Add ID properties to all headlines in the current file which
do not already have one."
  (interactive)
  (org-map-entries 'org-id-get-create))
#+end_src
*** Org jira
#+begin_src emacs-lisp :tangle packages.el
(package! org-jira)
#+end_src
#+begin_src emacs-lisp :tangle config.el
(use-package! org-jira
  :custom
  (org-jira-working-dir pii/org-jira-working-dir)
  (jiralib-url pii/jiralib-url)
  (jiralib-update-issue-fields-exclude-list '(components)))
#+end_src
*** Org auto tangle
Auto tangle org files
#+begin_src emacs-lisp :tangle packages.el
(package! org-auto-tangle :recipe (:host github :repo "yilkalargaw/org-auto-tangle" :files ("*.el")))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package org-auto-tangle :defer t :hook (org-mode . org-auto-tangle-mode))
#+end_src
*** El-Secretario
#+begin_src emacs-lisp :tangle (if home-config "packages.el" "no")
(package! el-secretario)
(package! el-secretario-org)
(package! el-secretario-mu4e)
#+end_src
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(defun el-secretario-daily-review ()
  (interactive)
  (el-secretario-start-session
   (lambda ()
     (list
      ;; First take care of email
      (el-secretario-mu4e-make-source "flag:unread")
      ;; Go through TODOs
      (el-secretario-org-make-source '(todo "TODO") (list (file-truename (concat org-directory "todo.org"))))
      (el-secretario-org-make-source '(todo "TODO") (list (file-truename (concat org-directory "arkmanager.org"))))
      (el-secretario-org-make-source '(todo "TODO") (list (file-truename (concat org-directory "bish.org"))))
      (el-secretario-org-make-source '(todo "TODO") (list (file-truename (concat org-directory "bytesource.org"))))
      (el-secretario-org-make-source '(todo "TODO") (list (file-truename (concat org-directory "n0s1.core.org"))))
      (el-secretario-org-make-source '(todo "TODO") (list (file-truename (concat org-directory "strifebot.org"))))))))
#+end_src
*** Org Exporting
**** Ox-man
Part of vanilla emacs (no package to install)
#+begin_src emacs-lisp :tangle config.el
(use-package ox-man)
    #+end_src
**** Ox-confluence
#+begin_src emacs-lisp :tangle packages.el
(package! ox-confluence :recipe (:host github :repo "nan0scho1ar/ox-confluence-modern" :files ("*.el")))
#+end_src

#+begin_src emacs-lisp :tangle config.el
(use-package ox-confluence)
#+end_src
