doom/.doom.d/config.el
  (map! (:prefix ("C-c n" . "roam")
         :desc "org-roam-node-random"              "a" #'org-roam-node-random
         :desc "org-roam-node-find"                "f" #'org-roam-node-find
         :desc "org-roam-ref-find"                 "F" #'org-roam-ref-find
         :desc "org-roam-graph"                    "g" #'org-roam-graph
         :desc "org-roam-node-insert"              "i" #'org-roam-node-insert
         :desc "org-roam-capture"                  "c" #'org-roam-capture
         :desc "org-roam-buffer-toggle"            "r" #'org-roam-buffer-toggle
         :desc "org-roam-buffer-display-dedicated" "R" #'org-roam-buffer-display-dedicated
         :desc "org-roam-db-sync"                  "s" #'org-roam-db-sync))

  (map! (:prefix ("C-c n d" . "dailies")
         :desc "org-roam-dailies-find-directory"     "-" #'org-roam-dailies-find-directory
         :desc "org-roam-dailies-goto-previous-note" "b" #'org-roam-dailies-goto-previous-note
         :desc "org-roam-dailies-goto-next-note"     "f" #'org-roam-dailies-goto-next-note
         :desc "org-roam-dailies-capture-today"      "n" #'org-roam-dailies-capture-today
         :desc "org-roam-dailies-capture-date"       "d" #'org-roam-dailies-capture-date
         :desc "org-roam-dailies-goto-date"          "D" #'org-roam-dailies-goto-date
         :desc "org-roam-dailies-capture-tomorrow"   "m" #'org-roam-dailies-capture-tomorrow
         :desc "org-roam-dailies-goto-tomorrow"      "M" #'org-roam-dailies-goto-tomorrow
         :desc "org-roam-dailies-capture-today"      "t" #'org-roam-dailies-capture-today
         :desc "org-roam-dailies-goto-today"         "T" #'org-roam-dailies-goto-today
         :desc "org-roam-dailies-capture-yesterday"  "y" #'org-roam-dailies-capture-yesterday
         :desc "org-roam-dailies-goto-yesterday"     "Y" #'org-roam-dailies-goto-yesterday))

  (map! (:prefix ("C-c n o" . "organize")
         :desc "org-roam-demote-entire-buffer" "d" #'org-roam-demote-entire-buffer
         :desc "org-roam-link-replace-all"     "s" #'org-roam-link-replace-all
         :desc "org-id-get-create"             "i" #'org-id-get-create
         :desc "org-roam-refile"               "f" #'org-roam-refile
         :desc "org-roam-alias-add"            "a" #'org-roam-alias-add
         :desc "org-roam-alias-remove"         "A" #'org-roam-alias-remove
         :desc "org-roam-ref-add"              "r" #'org-roam-ref-add
         :desc "org-roam-ref-remove"           "R" #'org-roam-ref-remove
         :desc "org-roam-tag-add"              "t" #'org-roam-tag-add
         :desc "org-roam-tag-remove"           "T" #'org-roam-tag-remove)))

(use-package! websocket :after org-roam)

(use-package! org-roam-ui :after org-roam :hook (org-roam . org-roam-ui-mode) :config)

(use-package! org-modern)
(after! org-modern
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (setq
   ;; Edit settings
   org-auto-align-tags nil
   org-tags-column 0
   org-catch-invisible-edits 'show-and-error
   org-special-ctrl-a/e t
   org-insert-heading-respect-content t

   ;; Org styling, hide markup etc.
   org-hide-emphasis-markers t
   org-pretty-entities t
   org-ellipsis "…"

   ;; Agenda styling
   org-agenda-block-separator ?─
   org-agenda-time-grid
   '((daily today require-timed)
     (800 1000 1200 1400 1600 1800 2000)
     " ┄┄┄┄┄ " "┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄")
   org-agenda-current-time-string
   "⭠ now ─────────────────────────────────────────────────")

  (global-org-modern-mode))

(defun string-to-tablified-buffer (str buffer-name sep)
  (with-current-buffer (get-buffer-create buffer-name)
    (org-mode)
    (org-modern-mode -1)
    (+word-wrap-mode -1)
    (erase-buffer)
    (insert str)
    (org-table-convert-region (point-min) (point-max) sep)
    (goto-line 2)
    (insert "|-|\n")
    (goto-char (point-min))
    (insert "|-|\n")
    (goto-char (point-max))
    (insert "|-|\n")
    (org-table-align)
    (beginning-of-buffer)
    (current-buffer)))

(defun tablify-sql-results (results)
  (string-to-tablified-buffer results "*SQL Results*" "\t"))

(defun my/popup-sql-results ()
  (interactive)
  (+popup-buffer (get-buffer-create "*SQL Results*")))

(defun my/org-add-ids-to-headlines-in-file ()
  "Add ID properties to all headlines in the current file which
do not already have one."
  (interactive)
  (org-map-entries 'org-id-get-create))

(use-package! org-jira
  :custom
  (org-jira-working-dir pii/org-jira-working-dir)
  (jiralib-url jiralib-url)
  (jiralib-update-issue-fields-exclude-list '(components)))

(use-package org-auto-tangle :defer t :hook (org-mode . org-auto-tangle-mode))

(use-package ox-man)

(use-package ox-confluence)
