doom/.doom.d/packages.el

(package! org-roam-ui)

(package! org-modern)

(package! org-jira)

(package! org-auto-tangle :recipe (:host github :repo "yilkalargaw/org-auto-tangle" :files ("*.el")))

(package! ox-confluence :recipe (:host github :repo "nan0scho1ar/ox-confluence-modern" :files ("*.el")))
