doom/.doom.d/config.org
** Python
*** LSP (using doom flag)
#+begin_src emacs-lisp :tangle no
(package! lsp-pyright)
#+end_src

#+begin_src emacs-lisp :tangle no
(use-package lsp-pyright
  :ensure t
  :hook (python-mode . (lambda ()
                          (require 'lsp-pyright)
                          (lsp))))  ; or lsp-deferred
#+end_src
*** Python Formatting
#+begin_src emacs-lisp :tangle config.el
;; This hook is now incomplete for some reason
(add-hook! 'editorconfig-after-apply-functions
  (defun +editorconfig-disable-formatter-maybe-h (props)
    (when (or (gethash 'indent_style props)
              (gethash 'indent_size props))
      (setq-local +format-with :none
                  +format-with-lsp 'nil))))

(setq +format-on-save-enabled-modes
      '(not python           ; TODO Figure out how to make black and editorconfig play nice again.
            emacs-lisp-mode  ; elisp's mechanisms are good enough
            sql-mode         ; sqlformat is currently broken
            tex-mode         ; latexindent is broken
            latex-mode))
#+end_src
*** Pytest
#+begin_src emacs-lisp :tangle config.el
(map! :map python-pytest-mode-map
      :n "q" #'delete-window
      :n "r" #'my/pytest
      :n "R" #'my/delete-window-then-open-repl)

(defun my/delete-window-then-open-repl ()
  (interactive)
  (delete-window)
  (split-window nil nil 'right)
  (evil-window-right 1)
  (+eval/open-repl-same-window))

(defun my/pytest ()
  "Run pytest colourful and verbose."
  (interactive)
  (python-pytest '("--color" "-v"))
  (evil-window-right 1))

(defun my/pytest-from-repl ()
  "Run pytest colourful and verbose."
  (interactive)
  (delete-window)
  (my/pytest))

(map! :mode python-mode :desc "Run pytests"
      :n "SPC T" #'my/pytest)

(map! :mode inferior-python-mode :desc "Run pytests"
      :n "SPC T" #'my/pytest-from-repl)

#+end_src
*** Treesitter hook
#+begin_src emacs-lisp :tangle config.el
(add-hook 'python-mode 'tree-sitter-mode)
#+end_src
*** Prettify symbols
#+begin_src emacs-lisp :tangle config.el
(setq python-prettify-symbols-alist
      '(("lambda"  . ?λ)))
#+end_src
*** YAML
#+begin_src emacs-lisp :tangle config.el
(setq hs-hide-all-non-comment-function #'ignore)
(setq-hook! 'yaml-mode-hook hs-hide-comments-when-hiding-all t)
#+end_src
** Elixir
*** Elixir compile buffer
#+begin_src emacs-lisp :tangle (if home-config "config.el" "no")
(map! :after elixir-mode
      :map elixir-mode-map
      :n "C-c C-c" #'alchemist-iex-compile-this-buffer-and-go)
#+end_src
*** Alchemist
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(after! alchemist
  (set-repl-handler! 'elixir-mode #'alchemist-iex-run)
  (add-hook 'elixir-mode-hook
            (lambda ()
              (add-hook 'after-save-hook 'alchemist-iex-reload-module))))
#+end_src
** Lisp
*** Elisp Help back
#+begin_src emacs-lisp :tangle config.el
;; Helpful history
(defvar lookup-documentation-history '())

(defun +lookup/documentation-back ()
  (interactive)
  (!cdr lookup-documentation-history)
  (if lookup-documentation-history
      (let* ((item (format "%S" (read (car lookup-documentation-history)))))
        (+lookup/documentation item)
        (message "Showing help for %S" item)
        (!cdr lookup-documentation-history))
    (message "No more help history remaining")))

(advice-add #'+lookup/documentation :before
            (lambda (identifier &rest _)
              (!cons identifier lookup-documentation-history)))

(map! :map helpful-mode-map :n "p" #'+lookup/documentation-back)

#+end_src
*** Geiser
#+begin_src emacs-lisp :tangle config.el
(setq geiser-debug-jump-to-debug-p nil)
(setq geiser-debug-show-debug-p nil)
#+end_src
** SQL
*** SQLeye
**** Install package
#+begin_src emacs-lisp :tangle packages.el
(package! sqleye :recipe (:host github :repo "nan0scho1ar/sqleye" :files ("*.el")))
#+end_src
**** Set SQLeye as SQL Mode eval handler
#+begin_src emacs-lisp :tangle config.el
(use-package! sqleye)
(set-eval-handler! 'sql-mode #'sqleye-send-region)
#+end_src
**** Add binding to toggle SQLeye buffer
#+begin_src emacs-lisp :tangle config.el
(map! :leader :desc "Open SQLeye Buffer" "o s" #'sqleye-toggle-buffer)
#+end_src
**** Add quickrun bindings inside the SQL interactive buffer
#+begin_src emacs-lisp :tangle config.el
(map! :map sql-interactive-mode-map :v "gr" #'sqleye-send-region-and-deselect)
#+end_src
* Project
** Gitmanager
*** Install Package
**** Home
#+begin_src emacs-lisp :tangle (if home-config "packages.el" "no")
(package! gitmanager :recipe (:local-repo "~/repos/me/gitmanager" :build (:not compile)))
#+end_src
**** Work
#+begin_src emacs-lisp :tangle (if work-config "packages.el" "no")
(package! gitmanager :recipe (:host github :repo "nan0scho1ar/gitmanager" :files ("*.el")))
#+end_src
*** Config
**** Both
#+begin_src emacs-lisp :tangle config.el
(use-package! gitmanager)
(after! gitmanager
  (setq gitmanager-repo-source 'gitmanager-cache-file)
  ;; (setq gitmanager-repo-source 'projectile)
  (map! :mode gitmanager-mode :n "RET" #'gitmanager-run-magit)
  (map! :mode gitmanager-mode :n "q" #'gitmanager-hide)
  (map! :mode gitmanager-mode :n "r" #'gitmanager-fetch-and-state)
  (map! :leader :desc "Open Gitmanager" "g m" #'gitmanager))
#+end_src
**** Work
#+begin_src emacs-lisp :tangle (if work-config "config.el" "no")
(after! gitmanager
  (setq gitmanager-cache-dir "~/.config/gitmanager/"))
#+end_src
** Ahoy
Depends on ansi-exec
*** Package
#+begin_src emacs-lisp :tangle packages.el
(package! ansi-exec :recipe (:host github :repo "nan0scho1ar/emacs-ansi-exec" :files ("*.el")))
(package! ahoy :recipe (:host github :repo "nan0scho1ar/emacs-ahoy" :files ("*.el")))
#+end_src
*** Config
#+begin_src emacs-lisp :tangle config.el
(use-package! ansi-exec)
(after! ansi-exec
  (use-package! ahoy
    :config
    (map! :mode ahoy-mode :n "q" #'delete-window)
    (map! :leader (:prefix ("p A" . "Ahoy")
                   :desc "Ahoy run cmd"       "A" #'ahoy
                   :desc "Ahoy run with args" "a" #'ahoy-run-with-args
                   :desc "Ahoy help"          "h" #'ahoy-help))))
#+end_src
* Misc
** Packages
*** Websocket
#+begin_src emacs-lisp :tangle packages.el
(package! websocket)
#+end_src
*** Simple-httpd
#+begin_src emacs-lisp :tangle packages.el
(package! simple-httpd)
#+end_src
*** F (file functions)
#+begin_src emacs-lisp :tangle packages.el
(package! f)
#+end_src
** Fix emacs everywhere hooks (kinda)
#+begin_src emacs-lisp :tangle config.el
(setq-hook! 'emacs-everywhere-init-hooks doom-inhibit-local-var-hooks t)
#+end_src
** Get string from file
#+begin_src emacs-lisp :tangle config.el
(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))
#+end_src
