doom/.doom.d/config.el

;; This hook is now incomplete for some reason
(add-hook! 'editorconfig-after-apply-functions
  (defun +editorconfig-disable-formatter-maybe-h (props)
    (when (or (gethash 'indent_style props)
              (gethash 'indent_size props))
      (setq-local +format-with :none
                  +format-with-lsp 'nil))))

(setq +format-on-save-enabled-modes
      '(not python           ; TODO Figure out how to make black and editorconfig play nice again.
            emacs-lisp-mode  ; elisp's mechanisms are good enough
            sql-mode         ; sqlformat is currently broken
            tex-mode         ; latexindent is broken
            latex-mode))

(map! :map python-pytest-mode-map
      :n "q" #'delete-window
      :n "r" #'my/pytest
      :n "R" #'my/delete-window-then-open-repl)

(defun my/delete-window-then-open-repl ()
  (interactive)
  (delete-window)
  (split-window nil nil 'right)
  (evil-window-right 1)
  (+eval/open-repl-same-window))

(defun my/pytest ()
  "Run pytest colourful and verbose."
  (interactive)
  (python-pytest '("--color" "-v"))
  (evil-window-right 1))

(defun my/pytest-from-repl ()
  "Run pytest colourful and verbose."
  (interactive)
  (delete-window)
  (my/pytest))

(map! :mode python-mode :desc "Run pytests"
      :n "SPC T" #'my/pytest)

(map! :mode inferior-python-mode :desc "Run pytests"
      :n "SPC T" #'my/pytest-from-repl)

(add-hook 'python-mode 'tree-sitter-mode)

(setq python-prettify-symbols-alist
      '(("lambda"  . ?λ)))

(after! alchemist
  (set-repl-handler! 'elixir-mode #'alchemist-iex-run)
  (add-hook 'elixir-mode-hook
            (lambda ()
              (add-hook 'after-save-hook 'alchemist-iex-reload-module))))

;; Helpful history
(defvar lookup-documentation-history '())

(defun +lookup/documentation-back ()
  (interactive)
  (!cdr lookup-documentation-history)
  (if lookup-documentation-history
      (let* ((item (format "%S" (read (car lookup-documentation-history)))))
        (+lookup/documentation item)
        (message "Showing help for %S" item)
        (!cdr lookup-documentation-history))
    (message "No more help history remaining")))

(advice-add #'+lookup/documentation :before
            (lambda (identifier &rest _)
              (!cons identifier lookup-documentation-history)))

(map! :map helpful-mode-map :n "p" #'+lookup/documentation-back)

(setq geiser-debug-jump-to-debug-p nil)
(setq geiser-debug-show-debug-p nil)

(use-package! sqleye)
(set-eval-handler! 'sql-mode #'sqleye-send-region)

(map! :leader :desc "Open SQLeye Buffer" "o s" #'sqleye-toggle-buffer)

(map! :map sql-interactive-mode-map :v "gr" #'sqleye-send-region-and-deselect)

(use-package! gitmanager)
(after! gitmanager
  (setq gitmanager-repo-source 'gitmanager-cache-file)
  ;; (setq gitmanager-repo-source 'projectile)
  (map! :mode gitmanager-mode :n "RET" #'gitmanager-run-magit)
  (map! :mode gitmanager-mode :n "q" #'gitmanager-hide)
  (map! :mode gitmanager-mode :n "r" #'gitmanager-fetch-and-state)
  (map! :leader :desc "Open Gitmanager" "g m" #'gitmanager))

(after! gitmanager
  (setq gitmanager-cache-dir "~/.config/gitmanager/"))

(use-package! ansi-exec)
(after! ansi-exec
  (use-package! ahoy
    :config
    (map! :mode ahoy-mode :n "q" #'delete-window)
    (map! :leader (:prefix ("p A" . "Ahoy")
                   :desc "Ahoy run cmd"       "A" #'ahoy
                   :desc "Ahoy run with args" "a" #'ahoy-run-with-args
                   :desc "Ahoy help"          "h" #'ahoy-help))))

(setq-hook! 'emacs-everywhere-init-hooks doom-inhibit-local-var-hooks t)

(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))
