doom/.doom.d/packages.el

(package! sqleye :recipe (:host github :repo "nan0scho1ar/sqleye" :files ("*.el")))

(package! gitmanager :recipe (:host github :repo "nan0scho1ar/gitmanager" :files ("*.el")))

(package! ansi-exec :recipe (:host github :repo "nan0scho1ar/emacs-ansi-exec" :files ("*.el")))
(package! ahoy :recipe (:host github :repo "nan0scho1ar/emacs-ahoy" :files ("*.el")))

(package! websocket)

(package! simple-httpd)

(package! f)
